src/Reports/ОтчетПоТекущейЛьготнойОчередиКанбан/ОтчетПоТекущейЛьготнойОчередиКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоТекущейЛьготнойОчередиКанбан</name>
</mdclass:Report>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоТекущейЛьготнойОчередиКанбан/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПолучитьДанныеПоЛОНаСервере()
ТабДок.Очистить();

ТаблицаЛО = Новый ТаблицаЗначений;
Массив = Новый Массив;

Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
Массив.Добавить(Тип("СправочникСсылка.Материалы"));

ТаблицаЛО.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаЛО.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
ТаблицаЛО.Колонки.Добавить("МТК",Новый ОписаниеТипов("ДокументСсылка.МаршрутнаяКарта"));
ТаблицаЛО.Колонки.Добавить("МПЗ",Новый ОписаниеТипов(Массив));
ТаблицаЛО.Колонки.Добавить("ДатаЛО",Новый ОписаниеТипов("Дата"));
ТаблицаЛО.Колонки.Добавить("КолЛО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,3)));

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
	
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ТекДата = ТекущаяДата();
ТабДок.Вывести(ОблШапка);
	
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.Период,
	|	ЛьготнаяОчередь.ПЗ,
	|	ЛьготнаяОчередь.Линейка,
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛьготнаяОчередь.ПЗ.НомерОчереди
	|ИТОГИ ПО
	|	ПЗ";
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПЗ.Следующий() Цикл	
	ВыборкаДетальныеЗаписи = ВыборкаПЗ.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТипЗнч(ВыборкаДетальныеЗаписи.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
			Подразделение = ВыборкаДетальныеЗаписи.МПЗ.Канбан.Подразделение;
			Иначе
			Подразделение = Константы.МестоХраненияОсновное.Получить().Подразделение;
			КонецЕсли; 
				Если Не ВыбПодразделение.Пустая() Тогда
					Если Подразделение <> ВыбПодразделение Тогда
					Продолжить;
					КонецЕсли; 
				КонецЕсли;  				
					Если ТекущаяДата() - ВыборкаДетальныеЗаписи.Период < СрокДавности*3600 Тогда
					Продолжить;
					КонецЕсли;
		ТЧ = ТаблицаЛО.Добавить(); 
		ТЧ.Линейка = ВыборкаПЗ.ПЗ.Линейка;
		ТЧ.Подразделение = Подразделение;
		ТЧ.МТК = ВыборкаПЗ.ПЗ.ДокументОснование;
		ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
		ТЧ.ДатаЛО = ВыборкаДетальныеЗаписи.Период;
		ТЧ.КолЛО = ОбщийМодульВызовСервера.ПолучитьТребуемоеКоличествоМПЗ(ВыборкаПЗ.ПЗ.Изделие,ВыборкаДетальныеЗаписи.МПЗ,ВыборкаПЗ.ПЗ.Количество); 
		КонецЦикла;
	КонецЦикла;	
		Если СортироватьПо = 1 Тогда
		ТаблицаЛО.Сортировать("Линейка,Подразделение,МПЗ,ДатаЛО");
		ИначеЕсли СортироватьПо = 2 Тогда
		ТаблицаЛО.Сортировать("Подразделение,Линейка,МПЗ,ДатаЛО");
		ИначеЕсли СортироватьПо = 3 Тогда
		ТаблицаЛО.Сортировать("МПЗ,Подразделение,Линейка,ДатаЛО");
		ИначеЕсли СортироватьПо = 4 Тогда
		ТаблицаЛО.Сортировать("ДатаЛО,Подразделение,Линейка,МПЗ");
		КонецЕсли;
			Для каждого ТЧ Из ТаблицаЛО Цикл
			ОблМПЗ.Параметры.Линейка = ТЧ.Линейка;
			ОблМПЗ.Параметры.Подразделение = ТЧ.Подразделение;
			ОблМПЗ.Параметры.Наименование = СокрЛП(ТЧ.МТК.Номенклатура.Наименование);
			ОблМПЗ.Параметры.Изделие = ТЧ.МТК.Номенклатура;
			ОблМПЗ.Параметры.Наимен = СокрЛП(ТЧ.МПЗ.Наименование);
			ОблМПЗ.Параметры.МПЗ = ТЧ.МПЗ;
			ОблМПЗ.Параметры.ЕдиницаИзмерения = ТЧ.МПЗ.ЕдиницаИзмерения;
			ОблМПЗ.Параметры.МТКНомер = ТЧ.МТК.Номер;
			ОблМПЗ.Параметры.МТК = ТЧ.МТК;
			ОблМПЗ.Параметры.ДатаЛО = ТЧ.ДатаЛО;
			ОблМПЗ.Параметры.Кол = ТЧ.КолЛО;
			ОблМПЗ.Параметры.КолСклад = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(ТЧ.Линейка.МестоХраненияКанбанов,ТЧ.МПЗ);
			ТабДок.Вывести(ОблМПЗ);	
			КонецЦикла; 
ОблКонец.Параметры.КолВсего = ТаблицаЛО.Итог("КолЛО");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
ПолучитьДанныеПоЛОНаСервере();	
КонецПроцедуры
